Revit 2024 API
CurveElement.CreateAreaBasedLoadBoundaryLine Method
 Creates an area based load boundary line.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static CurveElement CreateAreaBasedLoadBoundaryLine(
	Document document,
	Curve curve,
	ElementId levelId
)
Visual Basic
Public Shared Function CreateAreaBasedLoadBoundaryLine ( _
	document As Document, _
	curve As Curve, _
	levelId As ElementId _
) As CurveElement
Visual C++
public:
static CurveElement^ CreateAreaBasedLoadBoundaryLine(
	Document^ document,
	Curve^ curve,
	ElementId^ levelId
)
Parameters
document
Type: Autodesk.Revit.DB.Document
 The document in which to create the area based load boundary line.
curve
Type: Autodesk.Revit.DB.Curve
 The curve.
levelId
Type: Autodesk.Revit.DB.ElementId
 The id of level.
Return Value
 The newly created area based load boundary line.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  document is not a project document. -or- The input curve is not bound. -or- The curve is degenerate (its length is too close to zero). -or- The ElementId levelId is not a Level. -or- The curve doesn't lie in the plane of the level.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements).
Autodesk.Revit.Exceptions.ModificationForbiddenException |  The document is in failure mode: an operation has failed, and Revit requires the user to either cancel the operation or fix the problem (usually by deleting certain elements). -or- The document is being loaded, or is in the midst of another sensitive process.
Autodesk.Revit.Exceptions.ModificationOutsideTransactionException |  The document has no open transaction.
See Also
CurveElement Class
Autodesk.Revit.DB Namespace